drivaer/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [ 0 1 -1 0 0 0 0 ];
//internalField uniform (30.0 0.0 0.0);
internalField uniform (30 0.0 0.0);

boundaryField
{
    ffminx
    {

        type fixedValue;
        value uniform ( 30.0 0.0 0.0 );

/*
        type            uniformFixedValue;
        uniformValue    table
	(
            (0 	 	(5 0 0))
            //(20 	(10 0 0))
            //(40 	(15 0 0))
            //(60 	(20 0 0))
            //(80 	(25 0 0))
            (100 	(30 0 0))
	);
*/

    }

    ffmaxx
    {
        //type zeroGradient;
        //value uniform ( 0.0 0.0 0.0 );

	type		inletOutlet;
	inletValue	uniform (30 0 0);
	value		uniform (30 0 0);
    }

    ffminy
    {
        type symmetry;
    }

    ffmaxy
    {
        type slip;
    }

    ffminz
    {
        type fixedValue;
        value uniform ( 30.0 0.0 0.0 );

/*
        type            uniformFixedValue;
        uniformValue    table
	(
            (0 	 	(5 0 0))
            //(20 	(10 0 0))
            //(40 	(15 0 0))
            //(60 	(20 0 0))
            //(80 	(25 0 0))
            (100 	(30 0 0))
	);
*/
    }

    ffmaxz
    {
        type slip;
    }

    body2
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    ruotaant
    {
        //type fixedValue;
        //value uniform ( 0 0 0);

        type rotatingWallVelocity;
        value uniform ( 0.0 0.0 0.0 );
        origin ( 0.007 0.0 0.29 );
        axis ( 0.0 1.0 0.0 );
        omega -94;
    }

    ruotapost
    {
        //type fixedValue;
        //value uniform ( 0 0 0);

        type rotatingWallVelocity;
        value uniform ( 0.0 0.0 0.0 );
        origin ( 2.793 0.0 0.29 );
        axis ( 0.0 1.0 0.0 );
        omega -94;
    }

}
