drivaer/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    ddtSchemes
    {
        default steadyState;
    }

    gradSchemes
    {
        //default Gauss linear;
        default cellLimited Gauss linear 0.333;

        grad(U) cellLimited Gauss linear 1;
        grad(k) cellLimited Gauss linear 1;
        grad(omega) cellLimited Gauss linear 1;
    }

    divSchemes
    {
        default Gauss linear;

        div(phi,U) 	bounded Gauss linearUpwindV grad(U);

        //div(phi,k) 	bounded Gauss linearUpwind grad(k);
        //div(phi,omega) 	bounded Gauss linearUpwind grad(omega);

        div(phi,k) 	bounded Gauss upwind;
        div(phi,omega) 	bounded Gauss upwind;

        div((nuEff*dev(grad(U).T()))) Gauss linear;

    }

    interpolationSchemes
    {
        default linear;
    }

    laplacianSchemes
    {
        default Gauss linear limited 0.5;
    }

    snGradSchemes
    {
        default limited 0.5;
    }

    wallDist
    {
        method meshWave;
    }

